/**************************************************************************************
		              8*8LED点阵———显示数字实验																						  
***************************************************************************************/

#include "reg51.h"			 //此文件中定义了单片机的一些特殊功能寄存器
#include<intrins.h>
#include "Picture.h"
#include "stdlib.h"
#include "interruption.h"
#include "print.h"
#include "allnum.h"
#include "AD.h"

/*******************************************************************************
* 函 数 名       : main
* 函数功能		 : 主函数
* 输    入       : 无
* 输    出    	 : 无
*******************************************************************************/

void main()
{		
	UsartInit();
	Timer0Init();
	InitADC();
	while(1)
	{
		if(AD_get()>400)
		{
		  pattren(cry);
		}
		else
		{
			 pattren(smile);
		}
  }		
}


